Dmitrryy/Hello_stm32/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2021 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

#include "stm32f0xx_ll_rcc.h"
#include "stm32f0xx_ll_system.h"
#include "stm32f0xx_ll_bus.h"
#include "stm32f0xx_ll_gpio.h"
#include "stm32f0xx_ll_exti.h"

/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/

/* USER CODE BEGIN PV */

int counter_top = 7777;

#define A_INDICATOR_ID_PORT 11
#define B_INDICATOR_ID_PORT 12
#define C_INDICATOR_ID_PORT 13
#define D_INDICATOR_ID_PORT 14
#define E_INDICATOR_ID_PORT 15
#define F_INDICATOR_ID_PORT 16
#define G_INDICATOR_ID_PORT 17
#define DP_INDICATOR_ID_PORT 18

#define ANODE1_INDICATOR_ID_PORT 19
#define ANODE2_INDICATOR_ID_PORT 20
#define ANODE3_INDICATOR_ID_PORT 21
#define ANODE4_INDICATOR_ID_PORT 22



#define LED0_PORT GPIOA, LL_GPIO_PIN_1
#define LED1_PORT GPIOA, LL_GPIO_PIN_2
#define LED2_PORT GPIOA, LL_GPIO_PIN_3
#define LED3_PORT GPIOF, LL_GPIO_PIN_4
#define LED4_PORT GPIOF, LL_GPIO_PIN_5
#define LED5_PORT GPIOA, LL_GPIO_PIN_4
#define LED6_PORT GPIOA, LL_GPIO_PIN_5
#define LED7_PORT GPIOA, LL_GPIO_PIN_6
#define LED8_PORT GPIOA, LL_GPIO_PIN_7
#define LED9_PORT GPIOC, LL_GPIO_PIN_4


#define LED0_ON() LL_GPIO_SetOutputPin(LED0_PORT)
#define LED0_OFF() LL_GPIO_ResetOutputPin(LED0_PORT)
#define LED1_ON() LL_GPIO_SetOutputPin(LED1_PORT)
#define LED1_OFF() LL_GPIO_ResetOutputPin(LED1_PORT)
#define LED2_ON() LL_GPIO_SetOutputPin(LED2_PORT)
#define LED2_OFF() LL_GPIO_ResetOutputPin(LED2_PORT)
#define LED3_ON() LL_GPIO_SetOutputPin(LED3_PORT)
#define LED3_OFF() LL_GPIO_ResetOutputPin(LED3_PORT)
#define LED4_ON() LL_GPIO_SetOutputPin(LED4_PORT)
#define LED4_OFF() LL_GPIO_ResetOutputPin(LED4_PORT)
#define LED5_ON() LL_GPIO_SetOutputPin(LED5_PORT)
#define LED5_OFF() LL_GPIO_ResetOutputPin(LED5_PORT)
#define LED6_ON() LL_GPIO_SetOutputPin(LED6_PORT)
#define LED6_OFF() LL_GPIO_ResetOutputPin(LED6_PORT)
#define LED7_ON() LL_GPIO_SetOutputPin(LED7_PORT)
#define LED7_OFF() LL_GPIO_ResetOutputPin(LED7_PORT)
#define LED8_ON() LL_GPIO_SetOutputPin(LED8_PORT)
#define LED8_OFF() LL_GPIO_ResetOutputPin(LED8_PORT)
#define LED9_ON() LL_GPIO_SetOutputPin(LED9_PORT)
#define LED9_OFF() LL_GPIO_ResetOutputPin(LED9_PORT)

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
/* USER CODE BEGIN PFP */

void switchOutPortMood(uint32_t id, int mood);
void indicatorDisplay(uint16_t num);

void EXTI0_1_IRQHandler(void);

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{
  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */

  LL_APB1_GRP2_EnableClock(LL_APB1_GRP2_PERIPH_SYSCFG);
  LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_PWR);

  /* System interrupt init*/

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  /* USER CODE BEGIN 2 */

    NVIC_EnableIRQ(EXTI0_1_IRQn);
    NVIC_SetPriority(EXTI0_1_IRQn, 0);

  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {
    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */
    indicatorDisplay(counter_top);


    /*  {
          LED0_ON();
          LL_mDelay(100);
          LED0_OFF();
          LED1_ON();
          LL_mDelay(100);
          LED1_OFF();
          LED2_ON();
          LL_mDelay(100);
          LED2_OFF();
          LED3_ON();
          LL_mDelay(100);
          LED3_OFF();
          LED4_ON();
          LL_mDelay(100);
          LED4_OFF();
          LED5_ON();
          LL_mDelay(100);
          LED5_OFF();
          LED6_ON();
          LL_mDelay(100);
          LED6_OFF();
          LED7_ON();
          LL_mDelay(100);
          LED7_OFF();
          LED8_ON();
          LL_mDelay(100);
          LED8_OFF();
          LED9_ON();
          LL_mDelay(100);

          LED0_ON();
          LL_mDelay(100);
          LED0_OFF();
          LED1_ON();
          LL_mDelay(100);
          LED1_OFF();
          LED2_ON();
          LL_mDelay(100);
          LED2_OFF();
          LED3_ON();
          LL_mDelay(100);
          LED3_OFF();
          LED4_ON();
          LL_mDelay(100);
          LED4_OFF();
          LED5_ON();
          LL_mDelay(100);
          LED5_OFF();
          LED6_ON();
          LL_mDelay(100);
          LED6_OFF();
          LED7_ON();
          LL_mDelay(100);
          LED7_OFF();
          LED8_ON();
          LL_mDelay(100);

          LED0_ON();
          LL_mDelay(100);
          LED0_OFF();
          LED1_ON();
          LL_mDelay(100);
          LED1_OFF();
          LED2_ON();
          LL_mDelay(100);
          LED2_OFF();
          LED3_ON();
          LL_mDelay(100);
          LED3_OFF();
          LED4_ON();
          LL_mDelay(100);
          LED4_OFF();
          LED5_ON();
          LL_mDelay(100);
          LED5_OFF();
          LED6_ON();
          LL_mDelay(100);
          LED6_OFF();
          LED7_ON();
          LL_mDelay(100);

          LED0_ON();
          LL_mDelay(100);
          LED0_OFF();
          LED1_ON();
          LL_mDelay(100);
          LED1_OFF();
          LED2_ON();
          LL_mDelay(100);
          LED2_OFF();
          LED3_ON();
          LL_mDelay(100);
          LED3_OFF();
          LED4_ON();
          LL_mDelay(100);
          LED4_OFF();
          LED5_ON();
          LL_mDelay(100);
          LED5_OFF();
          LED6_ON();
          LL_mDelay(100);

          LED0_ON();
          LL_mDelay(100);
          LED0_OFF();
          LED1_ON();
          LL_mDelay(100);
          LED1_OFF();
          LED2_ON();
          LL_mDelay(100);
          LED2_OFF();
          LED3_ON();
          LL_mDelay(100);
          LED3_OFF();
          LED4_ON();
          LL_mDelay(100);
          LED4_OFF();
          LED5_ON();
          LL_mDelay(100);

          LED0_ON();
          LL_mDelay(100);
          LED0_OFF();
          LED1_ON();
          LL_mDelay(100);
          LED1_OFF();
          LED2_ON();
          LL_mDelay(100);
          LED2_OFF();
          LED3_ON();
          LL_mDelay(100);
          LED3_OFF();
          LED4_ON();
          LL_mDelay(100);

          LED0_ON();
          LL_mDelay(100);
          LED0_OFF();
          LED1_ON();
          LL_mDelay(100);
          LED1_OFF();
          LED2_ON();
          LL_mDelay(100);
          LED2_OFF();
          LED3_ON();
          LL_mDelay(100);

          LED0_ON();
          LL_mDelay(100);
          LED0_OFF();
          LED1_ON();
          LL_mDelay(100);
          LED1_OFF();
          LED2_ON();
          LL_mDelay(100);

          LED0_ON();
          LL_mDelay(100);
          LED0_OFF();
          LED1_ON();
          LL_mDelay(100);

          LED0_ON();
          LL_mDelay(100);

          LED0_OFF();
          LED1_OFF();
          LED2_OFF();
          LED3_OFF();
          LED4_OFF();
          LED5_OFF();
          LED6_OFF();
          LED7_OFF();
          LED8_OFF();
          LED9_OFF();
          LL_mDelay(100);
      }*/


