Dmitrryy/Hello_stm32/Core/Src/main.c
}

/* USER CODE BEGIN 4 */


void indicatorDisplay(uint16_t num)
{
    /*
 * 026
       4-разрядный 7-сегментный индикатор
                1  A  F 2  3  B
 ______________|__|__|__|__|__|__________
|    A    |    A    |    A    |    A    |
| F     B | F     B | F     B | F     B |
|    G    |    G    |    G    |    G    |
| E     C | E     C | E     C | E     C |
|    D  dp|    D  dp|    D  dp|    D  dp|
|_________|_________|_________|_________|
                |  |  |  |  |  |
                E  D dp  C  G  4

Соответствие отображаемого знака данным порта
общий анод
__________________________________________________
     |   двоичный вид по сегментам   |            |
Цифра|dp | G | F | E | D | C | B | A | Десятичный |
-----|---|---|---|---|---|---|---|---|------------|
  0  | 1 | 1 | 0 | 0 | 0 | 0 | 0 | 0 |    192     |
  1  | 1 | 1 | 1 | 1 | 1 | 0 | 0 | 1 |    249     |
  2  | 1 | 0 | 1 | 0 | 0 | 1 | 0 | 0 |    164     |
  3  | 1 | 0 | 1 | 1 | 0 | 0 | 0 | 0 |    176     |
  4  | 1 | 0 | 0 | 1 | 1 | 0 | 0 | 1 |    153     |
  5  | 1 | 0 | 0 | 1 | 0 | 0 | 1 | 0 |    146     |
  6  | 1 | 0 | 0 | 0 | 0 | 0 | 1 | 0 |    130     |
  7  | 1 | 1 | 1 | 1 | 1 | 0 | 0 | 0 |    248     |
  8  | 1 | 0 | 0 | 0 | 0 | 0 | 0 | 0 |    128     |
  9  | 1 | 0 | 0 | 1 | 0 | 0 | 0 | 0 |    144     |
 dp  | 0 | 1 | 1 | 1 | 1 | 1 | 1 | 1 |    127     |
-----*---*---*---*---*---*---*---*---*------------*

 */

    uint8_t digitMatrix[10][7] = {
           // A, B, C, D, E, F, G
            { 1, 1, 1, 1, 1, 1, 0 }, //0
            { 0, 1, 1, 0, 0, 0, 0 }, //1
            { 1, 1, 0, 1, 1, 0, 1 }, //2
            { 1, 1, 1, 1, 0, 0, 1 }, //3
            { 0, 1, 1, 0, 0, 1, 1 }, //4
            { 1, 0, 1, 1, 0, 1, 1 }, //5
            { 1, 0, 1, 1, 1, 1, 1 }, //6
            { 1, 1, 1, 0, 0, 0, 0 }, //7
            { 1, 1, 1, 1, 1, 1, 1 }, //8
            { 1, 1, 1, 0, 0, 1, 1 }, //9
    };

    const uint16_t timeLight = 3;

    const uint16_t n1 = (uint16_t)(num / 1000) % 10;
    const uint16_t n2 = (uint16_t)(num / 100) % 10;
    const uint16_t n3 = (uint16_t)(num / 10) % 10;
    const uint16_t n4 = num % 10;

    switchOutPortMood(ANODE1_INDICATOR_ID_PORT, 0);
    switchOutPortMood(ANODE2_INDICATOR_ID_PORT, 1);
    switchOutPortMood(ANODE3_INDICATOR_ID_PORT, 1);
    switchOutPortMood(ANODE4_INDICATOR_ID_PORT, 1);

    switchOutPortMood(A_INDICATOR_ID_PORT, digitMatrix[n1][0]);
    switchOutPortMood(B_INDICATOR_ID_PORT, digitMatrix[n1][1]);
    switchOutPortMood(C_INDICATOR_ID_PORT, digitMatrix[n1][2]);
    switchOutPortMood(D_INDICATOR_ID_PORT, digitMatrix[n1][3]);
    switchOutPortMood(E_INDICATOR_ID_PORT, digitMatrix[n1][4]);
    switchOutPortMood(F_INDICATOR_ID_PORT, digitMatrix[n1][5]);
    switchOutPortMood(G_INDICATOR_ID_PORT, digitMatrix[n1][6]);
    LL_mDelay(timeLight);


    switchOutPortMood(ANODE1_INDICATOR_ID_PORT, 1);
    switchOutPortMood(ANODE2_INDICATOR_ID_PORT, 0);

    switchOutPortMood(A_INDICATOR_ID_PORT, digitMatrix[n2][0]);
    switchOutPortMood(B_INDICATOR_ID_PORT, digitMatrix[n2][1]);
    switchOutPortMood(C_INDICATOR_ID_PORT, digitMatrix[n2][2]);
    switchOutPortMood(D_INDICATOR_ID_PORT, digitMatrix[n2][3]);
    switchOutPortMood(E_INDICATOR_ID_PORT, digitMatrix[n2][4]);
    switchOutPortMood(F_INDICATOR_ID_PORT, digitMatrix[n2][5]);
    switchOutPortMood(G_INDICATOR_ID_PORT, digitMatrix[n2][6]);
    LL_mDelay(timeLight);


    switchOutPortMood(ANODE2_INDICATOR_ID_PORT, 1);
    switchOutPortMood(ANODE3_INDICATOR_ID_PORT, 0);

    switchOutPortMood(A_INDICATOR_ID_PORT, digitMatrix[n3][0]);
    switchOutPortMood(B_INDICATOR_ID_PORT, digitMatrix[n3][1]);
    switchOutPortMood(C_INDICATOR_ID_PORT, digitMatrix[n3][2]);
    switchOutPortMood(D_INDICATOR_ID_PORT, digitMatrix[n3][3]);
    switchOutPortMood(E_INDICATOR_ID_PORT, digitMatrix[n3][4]);
    switchOutPortMood(F_INDICATOR_ID_PORT, digitMatrix[n3][5]);
    switchOutPortMood(G_INDICATOR_ID_PORT, digitMatrix[n3][6]);
    LL_mDelay(timeLight);


    switchOutPortMood(ANODE3_INDICATOR_ID_PORT, 1);
    switchOutPortMood(ANODE4_INDICATOR_ID_PORT, 0);

    switchOutPortMood(A_INDICATOR_ID_PORT, digitMatrix[n4][0]);
    switchOutPortMood(B_INDICATOR_ID_PORT, digitMatrix[n4][1]);
    switchOutPortMood(C_INDICATOR_ID_PORT, digitMatrix[n4][2]);
    switchOutPortMood(D_INDICATOR_ID_PORT, digitMatrix[n4][3]);
    switchOutPortMood(E_INDICATOR_ID_PORT, digitMatrix[n4][4]);
    switchOutPortMood(F_INDICATOR_ID_PORT, digitMatrix[n4][5]);
    switchOutPortMood(G_INDICATOR_ID_PORT, digitMatrix[n4][6]);
    LL_mDelay(timeLight);

}



void switchOutPortMood(uint32_t id, int mood)
{
    void* typePort = 0;
    unsigned int port = 0;

    switch(id)
    {
        case A_INDICATOR_ID_PORT:
            typePort = GPIOB;
            port = LL_GPIO_PIN_15;
            break;

        case B_INDICATOR_ID_PORT:
            typePort = GPIOC;
            port = LL_GPIO_PIN_7;
            break;

        case C_INDICATOR_ID_PORT:
            typePort = GPIOA;
            port = LL_GPIO_PIN_11;
            break;

        case D_INDICATOR_ID_PORT:
            typePort = GPIOA;
            port = LL_GPIO_PIN_9;
            break;

        case E_INDICATOR_ID_PORT:
            typePort = GPIOA;
            port = LL_GPIO_PIN_8;
            break;

        case F_INDICATOR_ID_PORT:
            typePort = GPIOC;
            port = LL_GPIO_PIN_6;
            break;

        case G_INDICATOR_ID_PORT:
            typePort = GPIOA;
            port = LL_GPIO_PIN_12;
            break;

        case DP_INDICATOR_ID_PORT:
            typePort = GPIOA;
            port = LL_GPIO_PIN_10;
            break;

        case ANODE1_INDICATOR_ID_PORT:
            typePort = GPIOC;
            port = LL_GPIO_PIN_5;
            break;

        case ANODE2_INDICATOR_ID_PORT:
            typePort = GPIOB;
            port = LL_GPIO_PIN_0;
            break;

        case ANODE3_INDICATOR_ID_PORT:
            typePort = GPIOB;
            port = LL_GPIO_PIN_1;
            break;

        case ANODE4_INDICATOR_ID_PORT:
            typePort = GPIOB;
            port = LL_GPIO_PIN_2;
            break;
    }

    if (mood == 0) {
        LL_GPIO_ResetOutputPin(typePort, port);
    }
    else if (mood == 1) {
        LL_GPIO_SetOutputPin(typePort, port);
    }
}


/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  __disable_irq();
  while (1)
  {
  }
  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
